conception/diagrammes/MCD/MCD_uml.puml
' Generated by Mocodo 4.2.11

@startuml "MCD"

!define Table(x) class "x" << (T,#fddbc7) >>
!define pk(x) <b>x</b>
hide methods
left to right direction
skinparam groupInheritance 2
skinparam lineThickness 2
skinparam lineColor #4393c3
skinparam backgroundColor #f7f7f7
skinparam classAttributeFontColor #000000
skinparam classAttributeFontName Monospaced
skinparam classAttributeFontSize 14
skinparam classBackgroundColor #fddbc7
skinparam classBorderColor #d6604d
skinparam classBorderThickness 2
skinparam classFontColor #000000
skinparam classFontName Arial
skinparam classFontSize 18
skinparam classHeaderBackgroundColor #f4a582

Table("USER") {
    {field} + pk(id_user)
    {field} + name
    {field} + email
    {field} + password
    {field} + date_created
    {field} + status
    {field} + id_role
}

"RECIPE" "*" --- "1..*" "USER": "CREATE"

Table("RECIPE") {
    {field} + pk(id_recipe)
    {field} + title
    {field} + description
    {field} + anecdote
    {field} + ingredients
    {field} + instructions
    {field} + source
    {field} + date_added
    {field} + id_category
}

"CATEGORY" "*" --- "1..*" "RECIPE": "ASSOCIATE"

Table("CATEGORY") {
    {field} + pk(id_category)
    {field} + name
}

"COMMENT" "*" --- "1..*" "USER": "LEAVE"

Table("COMMENT") {
    {field} + pk(id_comment)
    {field} + content
    {field} + date_comment
}

"SCORE" "*" --- "1..*" "USER": "GIVE"

Table("SCORE") {
    {field} + pk(id_score)
    {field} + score
    {field} + id_user
    {field} + id_recipe
}

"ROLE" "*" --- "1..*" "USER": "HAVE"

Table("ROLE") {
    {field} + pk(id_role)
    {field} + role
}

@enduml
